In [3]:
import pandas as pd

In [4]:
df_orders = pd.read_parquet('data/masked_orders.parquet')
df_driver_order_mapping = pd.read_parquet('data/masked_driver_order_mapping.parquet')
df_service_times = pd.read_parquet('data/masked_service_times.parquet')
df_order_articles = pd.read_parquet('data/masked_order_articles.parquet')

In [10]:
# Exploration
df_orders

,warehouse_id,order_time,has_elevator,floor,is_pre_order,is_business,web_order_id,customer_id
0,18,2024-12-17 09:00:00+01:00,False,0.0,True,True,806432,166859
1,8,2024-12-10 09:45:00+01:00,False,0.0,True,True,678738,167463
2,8,2024-11-21 10:45:00+01:00,False,NaN,True,True,347665,49336
3,13,2024-11-08 10:00:00+01:00,False,0.0,True,True,110643,172552
4,13,2025-01-06 13:15:48.730000+01:00,False,NaN,False,True,1139043,136281
...,...,...,...,...,...,...,...,...
1534684,4,2024-11-27 15:45:00+01:00,False,0.0,True,True,460582,433427
1534685,6,2025-01-20 09:11:40.430000+01:00,False,0.0,False,True,1382719,404857
1534686,6,2024-11-26 08:45:00+01:00,False,0.0,True,True,419104,404857
1534687,6,2024-12-02 13:15:00+01:00,False,0.0,True,True,542528,393199
1534688,37,2024-12-06 11:15:00+01:00,False,0.0,True,False,608605,380052

In [6]:
df_order_articles

          warehouse_id  box_id  article_id  article_weight_in_g  web_order_id
0                    3     NaN        3657                17250       1250399
1                    3     NaN        3657                17250       1250154
2                   32     NaN        2576                17000       1296951
3                   32     NaN        3975                15100        978668
4                   25     NaN        3670                11000        104995
...                ...     ...         ...                  ...           ...
15586377            35     NaN        3953                17800       1533370
15586378            35     NaN        3953                17800       1533370
15586379            35     NaN        3953                17800       1533370
15586380            35     NaN        3953                17800       1533370
15586381            35     NaN        3953                17800       1533370

[15586382 rows x 5 columns]

In [7]:
df_driver_order_mapping

         web_order_id  driver_id
0               51222        182
1               53503        182
2              166709        182
3              136190        182
4              176394        182
...               ...        ...
1534811        473982       9240
1534812        474113       9240
1534813        475628       9240
1534814        468676       9240
1534815        343063       3598

[1534816 rows x 2 columns]

In [8]:
df_service_times

,service_time_start,service_time_end,service_time_in_minutes,order_datetime,web_order_id,driver_id,trip_id,customer_id
0,2024-11-11 21:48:59+01:00,2024-11-11 21:57:56+01:00,8.950000,2024-11-11 20:45:00+01:00,1,3621,29687,35422
1,2024-11-05 13:27:30+01:00,2024-11-05 13:45:05+01:00,17.583333,2024-11-05 13:15:00+01:00,2,6575,10097,159165
2,2024-11-05 21:52:03+01:00,2024-11-05 22:09:28+01:00,17.416666,2024-11-05 20:00:00+01:00,3,6811,12316,377355
3,2024-11-12 21:01:30.013000+01:00,2024-11-12 21:15:30.087000+01:00,14.000000,2024-11-12 19:00:00+01:00,4,5183,31795,146455
4,2024-11-01 15:28:07+01:00,2024-11-01 15:37:01+01:00,8.900000,2024-11-01 13:45:00+01:00,5,694,966,210296
...,...,...,...,...,...,...,...,...
1534829,2025-01-30 09:28:42+01:00,2025-01-30 09:33:43+01:00,5.016666,2025-01-30 08:10:51.200000+01:00,1534830,10536,250427,454002
1534830,2025-01-30 09:36:48+01:00,2025-01-30 09:45:29+01:00,8.683333,2025-01-30 08:13:38.747000+01:00,1534831,10755,250425,221139
1534831,2025-01-30 09:49:06+01:00,2025-01-30 09:58:29+01:00,9.383333,2025-01-30 08:15:32.833000+01:00,1534832,6570,250428,529887
1534832,2025-01-30 09:59:50+01:00,2025-01-30 10:07:27+01:00,7.616666,2025-01-30 08:47:31.837000+01:00,1534833,10925,250431,365722
1534833,2025-01-30 10:12:55+01:00,2025-01-30 10:23:47+01:00,10.866666,2025-01-30 08:58:08.230000+01:00,1534834,10925,250431,423647